IDEA StatiCa Open Model
RigidLink.RigidRZ Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 DOF rigid in RZ dirrection
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool RigidRZ { get; set; }
Public Property RigidRZ As Boolean
	Get
	Set
public:
property bool RigidRZ {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
RigidLink Class
IdeaRS.OpenModel.Model Namespace